Repository: AlfCano/rk.data.wrangling
Catalog: inst/rkward/po/*.po
Languages: de, es, fr, pt_br

source: A suite of plugins for modern data manipulation using 'dplyr'. Includes batch transformations, recoding multiple variables, and creating composite scores.
de: Eine Suite von Plugins für die moderne Datenmanipulation mit 'dplyr'. Enthält Stapeltransformationen, Umkodierung mehrerer Variablen und Erstellung zusammengesetzter Scores.
es: Un conjunto de plugins para la manipulación moderna de datos usando 'dplyr'. Incluye transformaciones en lote, recodificación de múltiples variables y creación de puntuaciones compuestas.
fr: Une suite de plugins pour la manipulation moderne des données avec 'dplyr'. Inclut les transformations par lots, le recodage de multiples variables et la création de scores composites.
pt_br: Um conjunto de plugins para manipulação moderna de dados usando 'dplyr'. Inclui transformações em lote, recodificação de múltiplas variáveis e criação de pontuações compostas.

source: Batch Transform Variables
de: Variablen stapelweise transformieren
es: Transformar Variables en Lote
fr: Transformer des variables par lots
pt_br: Transformar Variáveis em Lote

source: Variable Selection
de: Variablenauswahl
es: Selección de Variables
fr: Sélection des variables
pt_br: Seleção de Variáveis

source: Variables to transform
de: Zu transformierende Variablen
es: Variables a transformar
fr: Variables à transformer
pt_br: Variáveis para transformar

source: Grouping variable(s) (Optional)
de: Gruppierungsvariable(n) (Optional)
es: Variable(s) de agrupación (Opcional)
fr: Variable(s) de regroupement (Optionnel)
pt_br: Variável(is) de agrupamento (Opcional)

source: Grouped Calculation
de: Gruppierte Berechnung
es: Cálculo Agrupado
fr: Calcul groupé
pt_br: Cálculo Agrupado

source: Transformation
es: Transformación
pt_br: Transformação

source: Function
de: Funktion
es: Función
fr: Fonction
pt_br: Função

source: Logarithm (log)
de: Logarithmus (log)
es: Logaritmo (log)
fr: Logarithme (log)
pt_br: Logaritmo (log)

source: Exponential (exp)
es: Exponencial (exp)
fr: Exponentiel (exp)
pt_br: Exponencial (exp)

source: Square Root (sqrt)
de: Quadratwurzel (sqrt)
es: Raíz Cuadrada (sqrt)
fr: Racine carrée (sqrt)
pt_br: Raiz Quadrada (sqrt)

source: Abs (abs)
de: Absolut (abs)
es: Absoluto (abs)
fr: Absolu (abs)
pt_br: Absoluto (abs)

source: Standardize (scale)
de: Standardisieren (scale)
es: Estandarizar (scale)
fr: Standardiser (scale)
pt_br: Padronizar (scale)

source: Mean (mean)
de: Mittelwert (mean)
es: Media (mean)
fr: Moyenne (mean)
pt_br: Média (mean)

source: Median (median)
es: Mediana (median)
fr: Médiane (median)
pt_br: Mediana (median)

source: Sum (sum)
de: Summe (sum)
es: Suma (sum)
fr: Somme (sum)
pt_br: Soma (sum)

source: Standard Deviation (sd)
de: Standardabweichung (sd)
es: Desviación Estándar (sd)
fr: Écart-type (sd)
pt_br: Desvio Padrão (sd)

source: Variance (var)
de: Varianz (var)
es: Varianza (var)
pt_br: Variância (var)

source: Min (min)
es: Mínimo (min)
pt_br: Mín (min)

source: Max (max)
es: Máximo (max)
pt_br: Máx (max)

source: Convert to Numeric
de: In Numerisch konvertieren
es: Convertir a Numérico
fr: Convertir en numérique
pt_br: Converter para Numérico

source: Convert to Factor
de: In Faktor konvertieren
es: Convertir a Factor
fr: Convertir en facteur
pt_br: Converter para Fator

source: Custom...
de: Benutzerdefiniert...
es: Personalizado...
fr: Personnalisé...
pt_br: Personalizado...

source: Ignore NAs (na.rm = TRUE)
de: NAs ignorieren (na.rm = TRUE)
es: Ignorar NAs (na.rm = TRUE)
fr: Ignorer les NA (na.rm = TRUE)
pt_br: Ignorar NAs (na.rm = TRUE)

source: Custom function (e.g., function(x) x^2)
de: Benutzerdefinierte Funktion (z.B. function(x) x^2)
es: Función personalizada (ej. function(x) x^2)
fr: Fonction personnalisée (ex : function(x) x^2)
pt_br: Função personalizada (ex: function(x) x^2)

source: Output Options
de: Ausgabeoptionen
es: Opciones de Salida
fr: Options de sortie
pt_br: Opções de Saída

source: Naming pattern (glue syntax)
de: Benennungsmuster (glue-Syntax)
es: Patrón de nombres (sintaxis glue)
fr: Modèle de nommage (syntaxe glue)
pt_br: Padrão de nomeação (sintaxe glue)

source: Use <b>{.col}</b> for original name and <b>{.fn}</b> for function name.<br>Leave empty to overwrite original variables.
de: Verwenden Sie <b>{.col}</b> für den ursprünglichen Namen und <b>{.fn}</b> für den Funktionsnamen.<br>Leer lassen, um ursprüngliche Variablen zu überschreiben.
es: Use <b>{.col}</b> para el nombre original y <b>{.fn}</b> para el nombre de la función.<br>Deje vacío para sobrescribir las variables originales.
fr: Utilisez <b>{.col}</b> pour le nom original et <b>{.fn}</b> pour le nom de la fonction.<br>Laissez vide pour écraser les variables originales.
pt_br: Use <b>{.col}</b> para o nome original e <b>{.fn}</b> para o nome da função.<br>Deixe vazio para sobrescrever as variáveis originais.

source: Append to original dataset (mutate)
de: An ursprünglichen Datensatz anhängen (mutate)
es: Anexar al conjunto de datos original (mutate)
fr: Ajouter au jeu de données original (mutate)
pt_br: Anexar ao conjunto de dados original (mutate)

source: Preview data
de: Datenvorschau
es: Previsualizar datos
fr: Aperçu des données
pt_br: Pré-visualizar dados

source: <i>Note: Preview limited to the first selected variable and 50 rows.<br><b>Warning:</b> Aggregation functions (sum, mean) in preview will only reflect the 50 sampled rows, not the full dataset.</i>
de: <i>Hinweis: Vorschau auf die erste ausgewählte Variable und 50 Zeilen begrenzt.<br><b>Warnung:</b> Aggregationsfunktionen (Summe, Mittelwert) in der Vorschau spiegeln nur die 50 Stichprobenzeilen wider, nicht den gesamten Datensatz.</i>
es: <i>Nota: Previsualización limitada a la primera variable seleccionada y 50 filas.<br><b>Advertencia:</b> Las funciones de agregación (suma, media) en la vista previa solo reflejarán las 50 filas muestreadas, no el conjunto de datos completo.</i>
fr: <i>Note : Aperçu limité à la première variable sélectionnée et 50 lignes.<br><b>Attention :</b> Les fonctions d'agrégation (somme, moyenne) dans l'aperçu ne refléteront que les 50 lignes échantillonnées, pas le jeu de données complet.</i>
pt_br: <i>Nota: Pré-visualização limitada à primeira variável selecionada e 50 linhas.<br><b>Aviso:</b> Funções de agregação (soma, média) na pré-visualização refletirão apenas as 50 linhas amostradas, não o conjunto de dados completo.</i>

source: Save to (overwrite or new object)
de: Speichern unter (überschreiben oder neues Objekt)
es: Guardar en (sobrescribir o nuevo objeto)
fr: Enregistrer dans (écraser ou nouvel objet)
pt_br: Salvar em (sobrescrever ou novo objeto)

source: Batch Transform Created:
de: Stapeltransformation erstellt:
es: Transformación en Lote Creada:
fr: Transformation par lots créée :
pt_br: Transformação em Lote Criada:

source: Apply a function to multiple variables simultaneously using dplyr::across.
de: Wenden Sie eine Funktion gleichzeitig auf mehrere Variablen an, indem Sie dplyr::across verwenden.
es: Aplicar una función a múltiples variables simultáneamente usando dplyr::across.
fr: Appliquer une fonction à plusieurs variables simultanément en utilisant dplyr::across.
pt_br: Aplicar uma função a múltiplas variáveis simultaneamente usando dplyr::across.

source: Batch Recode Variables
de: Variablen stapelweise umkodieren
es: Recodificar Variables en Lote
fr: Recoder des variables par lots
pt_br: Recodificar Variáveis em Lote

source: Variables to recode
de: Umzukodierende Variablen
es: Variables a recodificar
fr: Variables à recoder
pt_br: Variáveis para recodificar

source: Recode Rules
de: Umkodierungsregeln
es: Reglas de Recodificación
fr: Règles de recodage
pt_br: Regras de Recodificação

source: Input Data Type (Old Value)
de: Eingabedatentyp (Alter Wert)
es: Tipo de Dato de Entrada (Valor Antiguo)
fr: Type de données d'entrée (Ancienne valeur)
pt_br: Tipo de Dados de Entrada (Valor Antigo)

source: Numeric / Integer
de: Numerisch / Ganzzahl
es: Numérico / Entero
fr: Numérique / Entier
pt_br: Numérico / Inteiro

source: Character / Factor
de: Zeichen / Faktor
es: Carácter / Factor
fr: Caractère / Facteur
pt_br: Caractere / Fator

source: Mapping Rules
de: Zuordnungsregeln
es: Reglas de Mapeo
fr: Règles de mappage
pt_br: Regras de Mapeamento

source: Default Behavior
de: Standardverhalten
es: Comportamiento Predeterminado
fr: Comportement par défaut
pt_br: Comportamento Padrão

source: Unmatched values (Else)
de: Nicht übereinstimmende Werte (Sonst)
es: Valores no coincidentes (Else)
fr: Valeurs non correspondantes (Sinon)
pt_br: Valores não correspondidos (Else)

source: Copy original values (Default)
de: Ursprüngliche Werte kopieren (Standard)
es: Copiar valores originales (Predeterminado)
fr: Copier les valeurs originales (Défaut)
pt_br: Copiar valores originais (Padrão)

source: Set to NA
de: Auf NA setzen
es: Establecer como NA
fr: Mettre à NA
pt_br: Definir como NA

source: Specific value...
de: Spezifischer Wert...
es: Valor específico...
fr: Valeur spécifique...
pt_br: Valor específico...

source: Value
de: Wert
es: Valor
fr: Valeur
pt_br: Valor

source: Output Data Type (New Value)
de: Ausgabedatentyp (Neuer Wert)
es: Tipo de Dato de Salida (Valor Nuevo)
fr: Type de données de sortie (Nouvelle valeur)
pt_br: Tipo de Dados de Saída (Novo Valor)

source: Suffix
es: Sufijo
fr: Suffixe
pt_br: Sufixo

source: Convert output to factor
de: Ausgabe in Faktor konvertieren
es: Convertir salida a factor
fr: Convertir la sortie en facteur
pt_br: Converter saída para fator

source: <i>Note: Preview limited to the first selected variable and 50 rows.</i>
de: <i>Hinweis: Vorschau auf die erste ausgewählte Variable und 50 Zeilen begrenzt.</i>
es: <i>Nota: Previsualización limitada a la primera variable seleccionada y 50 filas.</i>
fr: <i>Note : Aperçu limité à la première variable sélectionnée et 50 lignes.</i>
pt_br: <i>Nota: Pré-visualização limitada à primeira variável selecionada e 50 linhas.</i>

source: Save result object
de: Ergebnisobjekt speichern
es: Guardar objeto resultado
fr: Enregistrer l'objet résultat
pt_br: Salvar objeto resultante

source: Recoded Variables Created in:
de: Umkodierte Variablen erstellt in:
es: Variables Recodificadas Creadas en:
fr: Variables recodées créées dans :
pt_br: Variáveis Recodificadas Criadas em:

source: Recode multiple variables using a grid of Old/New values.
de: Mehrere Variablen mithilfe eines Rasters von Alt/Neu-Werten umkodieren.
es: Recodificar múltiples variables usando una cuadrícula de valores Antiguo/Nuevo.
fr: Recoder plusieurs variables en utilisant une grille de valeurs Ancienne/Nouvelle.
pt_br: Recodificar múltiplas variáveis usando uma grade de valores Antigo/Novo.

source: Create Composite Score
de: Zusammengesetzten Score erstellen
es: Crear Puntuación Compuesta
fr: Créer un score composite
pt_br: Criar Pontuação Composta

source: Items to aggregate
de: Zu aggregierende Elemente
es: Ítems para agregar
fr: Éléments à agréger
pt_br: Itens para agregar

source: Settings
de: Einstellungen
es: Configuración
fr: Paramètres
pt_br: Configurações

source: Aggregation Method
de: Aggregationsmethode
es: Método de Agregación
fr: Méthode d'agrégation
pt_br: Método de Agregação

source: Mean (Average)
de: Mittelwert (Durchschnitt)
es: Media (Promedio)
fr: Moyenne
pt_br: Média

source: Sum (Total)
de: Summe (Total)
es: Suma (Total)
fr: Somme (Total)
pt_br: Soma (Total)

source: Minimum
es: Mínimo
pt_br: Mínimo

source: Maximum
es: Máximo
pt_br: Máximo

source: Count (N valid)
de: Anzahl (N gültig)
es: Recuento (N válidos)
fr: Nombre (N valide)
pt_br: Contagem (N válido)

source: Remove NAs (na.rm = TRUE)
de: NAs entfernen (na.rm = TRUE)
es: Eliminar NAs (na.rm = TRUE)
fr: Supprimer les NA (na.rm = TRUE)
pt_br: Remover NAs (na.rm = TRUE)

source: Name of new variable
de: Name der neuen Variable
es: Nombre de la nueva variable
fr: Nom de la nouvelle variable
pt_br: Nome da nova variável

source: Append to original dataset
de: An ursprünglichen Datensatz anhängen
es: Anexar al conjunto de datos original
fr: Ajouter au jeu de données original
pt_br: Anexar ao conjunto de dados original

source: <i>Note: Preview limited to 50 rows.</i>
de: <i>Hinweis: Vorschau auf 50 Zeilen begrenzt.</i>
es: <i>Nota: Previsualización limitada a 50 filas.</i>
fr: <i>Note : Aperçu limité à 50 lignes.</i>
pt_br: <i>Nota: Pré-visualização limitada a 50 linhas.</i>

source: Save result as
de: Ergebnis speichern als
es: Guardar resultado como
fr: Enregistrer le résultat sous
pt_br: Salvar resultado como

source: Composite Score Created:
de: Zusammengesetzter Score erstellt:
es: Puntuación Compuesta Creada:
fr: Score composite créé :
pt_br: Pontuação Composta Criada:

source: Calculate row-wise scores (Mean/Sum) from multiple variables.
de: Berechnen Sie zeilenweise Scores (Mittelwert/Summe) aus mehreren Variablen.
es: Calcular puntuaciones por fila (Media/Suma) de múltiples variables.
fr: Calculer des scores par ligne (Moyenne/Somme) à partir de plusieurs variables.
pt_br: Calcular pontuações por linha (Média/Soma) de múltiplas variáveis.
